{
        "musculo": {
          "opciones": [
            "Pecho",
            "Espalda",
            "Piernas",
            "Brazos",
            "Hombros",
            "Abdomen"
          ],
          "seleccion": "",
          "ejercicios": {
            "Pecho": [
              {
                "nombre": "Press de Banca",
                "instrucciones": [
                  "Coloca las manos en la barra a la altura de los hombros.",
                  "Mantén los pies firmes en el suelo y la espalda ligeramente arqueada.",
                  "Baja la barra hasta que toque suavemente tu pecho y luego empújala hacia arriba de forma controlada."
                ],
                "imagen": "img/ejercicios/Press de Banca.png",
                "video": "Video/Press de Banca.mov"
              },
              {
                "nombre": "Aperturas con Mancuernas",
                "instrucciones": [
                  "Acuéstate en un banco con una mancuerna en cada mano.",
                  "Mantén los brazos ligeramente flexionados y abre los brazos hacia los lados, sintiendo el estiramiento en el pecho.",
                  "Junta las mancuernas nuevamente de forma controlada en la parte superior."
                ],
                "imagen": "img/ejercicios/Aperturas con Mancuernas.png",
                "video": "Video/Aperturas con Mancuernas.mov"
              },
              {
                "nombre": "Press Inclinado",
                "instrucciones": [
                  "Ajusta el banco a una inclinación de aproximadamente 45 grados.",
                  "Sujeta la barra o las mancuernas con las manos a la altura de los hombros.",
                  "Baja de forma controlada hasta el pecho y empuja de regreso hacia arriba, manteniendo el enfoque en la parte superior del pecho."
                ],
                "imagen": "img/ejercicios/Press Inclinado.png",
                "video": "Video/Press Inclinado.mov"
              }
            ],
            "Espalda": [
              {
                "nombre": "Remo con Barra",
                "instrucciones": [
                  "Coloca la barra en el suelo frente a ti, con una posición de agarre a la anchura de los hombros.",
                  "Inclina tu torso hacia adelante mientras mantienes la espalda recta.",
                  "Levanta la barra hacia tu abdomen, apretando los músculos de la espalda, y baja de forma controlada."
                ],
                "imagen": "img/ejercicios/Remo con Barra.png",
                "video": "Video/Remo con Barras.mov"
              },
              {
                "nombre": "Dominadas",
                "instrucciones": [
                  "Sujeta la barra de dominadas con un agarre ligeramente más ancho que los hombros.",
                  "Mantén el cuerpo recto y sube hasta que la barbilla esté por encima de la barra.",
                  "Baja lentamente hasta la posición inicial."
                ],
                "imagen": "img/ejercicios/Dominadas.png",
                "video": "Video/Dominadas.mov"
              },
              {
                "nombre": "Peso Muerto",
                "instrucciones": [
                  "Coloca la barra en el suelo frente a ti y agarra con ambas manos a la anchura de los hombros.",
                  "Mantén la espalda recta y levanta la barra extendiendo las caderas y las rodillas.",
                  "Baja la barra de forma controlada hasta el suelo."
                ],
                "imagen": "img/ejercicios/Peso Muerto.png",
                "video": "Video/Peso Muerto.mov"
              }
            ],
            "Piernas": [
              {
                "nombre": "Sentadilla Libre",
                "instrucciones": [
                  "Toma un peso que puedas cargar sin mucho problema.",
                  "Mantén la barra estable en tu espalda.",
                  "Mantén la espalda recta.",
                  "Baja de forma controlada hasta los 90 grados."
                ],
                "imagen": "img/ejercicios/Sentadilla Libre.png",
                "video": "Video/Sentadilla Libre.mov"
              },
              {
                "nombre": "Prensa",
                "instrucciones": [
                  "Coloca los pies en la plataforma a la anchura de los hombros.",
                  "Desbloquea la máquina y baja la plataforma controladamente hasta que las rodillas estén en un ángulo de 90 grados.",
                  "Empuja la plataforma hacia arriba sin bloquear las rodillas."
                ],
                "imagen": "img/ejercicios/Prensa.png",
                "video": "Video/Prensa.mov"
              },
              {
                "nombre": "Extensiones de Cuadriceps",
                "instrucciones": [
                  "Siéntate en la máquina con las piernas debajo del cojín.",
                  "Extiende las piernas hasta que estén completamente rectas, sintiendo la contracción en los cuádriceps.",
                  "Baja lentamente las piernas a la posición inicial."
                ],
                "imagen": "img/ejercicios/Extensiones de Cuadriceps.png",
                "video": "Video/Extensiones de Cuadriceps.mov"
              },
              {
                "nombre": "Sentadilla Hack",
                "instrucciones": [
                  "Colócate en la máquina de sentadillas Hack con los hombros apoyados.",
                  "Desbloquea el equipo y baja controladamente hasta los 90 grados.",
                  "Empuja hacia arriba, concentrándote en trabajar los cuádriceps y glúteos."
                ],
                "imagen": "img/ejercicios/Sentadilla Hack.png",
                "video": "Video/Sentadilla Hack.mov"
              },
              {
                "nombre": "Sentadilla Smith",
                "instrucciones": [
                  "Colócate bajo la barra Smith con los pies alineados con los hombros.",
                  "Baja lentamente en una posición de sentadilla hasta que las rodillas estén a 90 grados.",
                  "Empuja hacia arriba de forma controlada manteniendo la espalda recta."
                ],
                "imagen": "img/ejercicios/Sentadilla Smith.png",
                "video": "Video/Sentadilla Smith.mov"
              }
            ],
            "Brazos": [
              {
                "nombre": "Curl de Biceps",
                "instrucciones": [
                  "Sujeta una barra o mancuernas con las manos a la anchura de los hombros.",
                  "Flexiona los codos y lleva el peso hacia los hombros, manteniendo los codos pegados al cuerpo.",
                  "Baja lentamente el peso a la posición inicial."
                ],
                "imagen": "img/ejercicios/Curl de Biceps.png",
                "video": "Video/Curl de Biceps.mov"
              },

              {
                "nombre": "Triceps en Polea",
                "instrucciones": [
                  "Sujeta la cuerda o barra de la polea con las manos en pronación.",
                  "Empuja la cuerda hacia abajo hasta que los brazos estén completamente extendidos.",
                  "Regresa de forma controlada a la posición inicial."
                ],
                "imagen": "img/ejercicios/Triceps en Polea.png",
                "video": "Video/Triceps en Polea.mp4"
              },

              {
                "nombre": "Curl Martillo",
                "instrucciones": [
                  "Sujeta una mancuerna en cada mano con las palmas hacia el cuerpo.",
                  "Flexiona los codos, levantando las mancuernas hacia los hombros.",
                  "Baja lentamente hasta la posición inicial."
                ],
                "imagen": "img/ejercicios/Curl Martillo.png",
                "video": "Video/Curl Martillo.mov"
              }
            ],
            "Hombros": [
              {
                "nombre": "Press Militar",
                "instrucciones": [
                  "Sujeta la barra con las manos un poco más anchas que los hombros.",
                  "Empuja la barra hacia arriba hasta que los brazos estén completamente extendidos.",
                  "Baja de forma controlada hasta la altura del pecho."
                ],
                "imagen": "img/ejercicios/Press Militar.png",
                "video": "Video/Press Militar.mov"
              },

              {
                "nombre": "Elevaciones Laterales",
                "instrucciones": [
                  "Toma una mancuerna en cada mano con los brazos a los lados.",
                  "Eleva los brazos lateralmente hasta que estén a la altura de los hombros.",
                  "Baja lentamente los brazos a la posición inicial."
                ],
                "imagen": "img/ejercicios/Elevaciones Laterales.png",
                "video": "Video/Elevacion Laterales.mov"
              },

              {
                "nombre": "Face Pull",
                "instrucciones": [
                  "Sujeta la cuerda de una polea alta con las manos en pronación.",
                  "Jala la cuerda hacia tu cara, manteniendo los codos altos.",
                  "Vuelve a la posición inicial de forma controlada."
                ],
                "imagen": "img/ejercicios/Face Pull.png",
                "video": "Video/Face Pull.mov"
              }
            ],

            "Abdomen": [
              {
                "nombre": "Crunch",
                "instrucciones": [
                  "Acuéstate boca arriba con las rodillas dobladas.",
                  "Cruza las manos sobre el pecho y levanta los hombros del suelo, apretando los músculos abdominales.",
                  "Baja de forma controlada a la posición inicial."
                ],
                "imagen": "img/ejercicios/Crunch.png",
                "video": "Video/Crunch.mov"
              },

              {
                "nombre": "Plancha",
                "instrucciones": [
                  "Coloca los antebrazos en el suelo con el cuerpo estirado.",
                  "Mantén el cuerpo recto y los abdominales contraídos.",
                  "Mantén la posición el mayor tiempo posible."
                ],
                "imagen": "img/ejercicios/Plancha.png",
                "video": "Video/Plancha.mov"
              },
              {
                "nombre": "Elevaciones de Piernas",
                "instrucciones": [
                  "Acuéstate boca arriba con las piernas extendidas.",
                  "Levanta las piernas hasta formar un ángulo de 90 grados.",
                  "Baja lentamente las piernas sin tocar el suelo."
                ],
                "imagen": "img/ejercicios/Elevaciones de Piernas.png",
                "video": "Video/Elevacion de Piernas.mov"
              }
            ]
          }
        }
      }
  